shu-liu1314/iotc-evse-example/nxpev1060/RT1060_EasyEVSE/RT1060_EasyEVSE_V2/board/pin_mux.h
/* GPIO_B0_07 (coord A9), LCDIF_D3/BT_CFG[3] */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_D3_PERIPHERAL                                 LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_D3_SIGNAL                                lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_LCDIF_D3_CHANNEL                                       3U   /*!< Signal channel */

/* GPIO_B0_06 (coord A8), LCDIF_D2/BT_CFG[2] */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_D2_PERIPHERAL                                 LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_D2_SIGNAL                                lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_LCDIF_D2_CHANNEL                                       2U   /*!< Signal channel */

/* GPIO_B0_05 (coord B8), LCDIF_D1/BT_CFG[1] */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_D1_PERIPHERAL                                 LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_D1_SIGNAL                                lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_LCDIF_D1_CHANNEL                                       1U   /*!< Signal channel */

/* GPIO_B0_01 (coord E7), LCDIF_ENABLE */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_ENABLE_PERIPHERAL                             LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_ENABLE_SIGNAL                          lcdif_enable   /*!< Signal name */

/* GPIO_B0_02 (coord E8), LCDIF_HSYNC */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_HSYNC_PERIPHERAL                              LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_HSYNC_SIGNAL                            lcdif_hsync   /*!< Signal name */

/* GPIO_B0_03 (coord D8), LCDIF_VSYNC */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_VSYNC_PERIPHERAL                              LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_VSYNC_SIGNAL                            lcdif_vsync   /*!< Signal name */

/* GPIO_B1_15 (coord B14), USB_HOST_PWR/BACKLIGHT_CTL */
/* Routed pin properties */
#define BOARD_INITPINS_BACKLIGHT_CTL_PERIPHERAL                            GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_BACKLIGHT_CTL_SIGNAL                              gpio_io   /*!< Signal name */
#define BOARD_INITPINS_BACKLIGHT_CTL_CHANNEL                                 31U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BACKLIGHT_CTL_GPIO                                  GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_BACKLIGHT_CTL_GPIO_PIN                                31U   /*!< GPIO pin number */
#define BOARD_INITPINS_BACKLIGHT_CTL_GPIO_PIN_MASK                   (1U << 31U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_BACKLIGHT_CTL_PORT                                  GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_BACKLIGHT_CTL_PIN                                     31U   /*!< PORT pin number */
#define BOARD_INITPINS_BACKLIGHT_CTL_PIN_MASK                        (1U << 31U)   /*!< PORT pin mask */

/* GPIO_AD_B0_11 (coord G10), JTAG_nTRST/J21[3]/INT2_COMBO/LCD_TOUCH_INT/J22[3]/U32[9] */
/* Routed pin properties */
#define BOARD_INITPINS_SE_RST_PERIPHERAL                                   GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_SE_RST_SIGNAL                                     gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SE_RST_CHANNEL                                        11U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SE_RST_GPIO                                         GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SE_RST_GPIO_PIN                                       11U   /*!< GPIO pin number */
#define BOARD_INITPINS_SE_RST_GPIO_PIN_MASK                          (1U << 11U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_SE_RST_PORT                                         GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_SE_RST_PIN                                            11U   /*!< PORT pin number */
#define BOARD_INITPINS_SE_RST_PIN_MASK                               (1U << 11U)   /*!< PORT pin mask */

/* GPIO_SD_B0_00 (coord J4), SD1_CMD/J24[6] */
/* Routed pin properties */
#define BOARD_INITPINS_RC_663_SPI_CLK_PERIPHERAL                          LPSPI1   /*!< Peripheral name */
#define BOARD_INITPINS_RC_663_SPI_CLK_SIGNAL                                 SCK   /*!< Signal name */

/* GPIO_SD_B0_02 (coord J1), SD1_D0/J24[4]/SPI_MOSI/PWM */
/* Routed pin properties */
#define BOARD_INITPINS_RC_633_SPI_MOSI_PERIPHERAL                         LPSPI1   /*!< Peripheral name */
#define BOARD_INITPINS_RC_633_SPI_MOSI_SIGNAL                                SDO   /*!< Signal name */

/* GPIO_SD_B0_03 (coord K1), SD1_D1/J24[5]/SPI_MISO */
/* Routed pin properties */
#define BOARD_INITPINS_RC_633_SPI_MISO_PERIPHERAL                         LPSPI1   /*!< Peripheral name */
#define BOARD_INITPINS_RC_633_SPI_MISO_SIGNAL                                SDI   /*!< Signal name */

/* GPIO_SD_B0_01 (coord J3), SD1_CLK/J24[3] */
/* Routed pin properties */
#define BOARD_INITPINS_RC_633_SPI_SSEL_PERIPHERAL                         LPSPI1   /*!< Peripheral name */
#define BOARD_INITPINS_RC_633_SPI_SSEL_SIGNAL                               PCS0   /*!< Signal name */

/* GPIO_AD_B0_03 (coord G11), USB_OTG1_OC/J24[1] */
/* Routed pin properties */
#define BOARD_INITPINS_RC_633_IRQ_PERIPHERAL                               GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_RC_633_IRQ_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_INITPINS_RC_633_IRQ_CHANNEL                                     3U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RC_633_IRQ_GPIO                                     GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_RC_633_IRQ_GPIO_PIN                                    3U   /*!< GPIO pin number */
#define BOARD_INITPINS_RC_633_IRQ_GPIO_PIN_MASK                       (1U << 3U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_RC_633_IRQ_PORT                                     GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_RC_633_IRQ_PIN                                         3U   /*!< PORT pin number */
#define BOARD_INITPINS_RC_633_IRQ_PIN_MASK                            (1U << 3U)   /*!< PORT pin mask */

