shu-liu1314/iotc-evse-example/nxpev1060/RT1060_EasyEVSE/RT1060_EasyEVSE_V2/board/pin_mux.h
/* GPIO_AD_B1_08 (coord H13), AUD_INT/CSI_D9//J35[13]/J22[4] */
/* Routed pin properties */
#define BOARD_INITPINS_RC_633_nPDOWN_PERIPHERAL                            GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_RC_633_nPDOWN_SIGNAL                              gpio_io   /*!< Signal name */
#define BOARD_INITPINS_RC_633_nPDOWN_CHANNEL                                 24U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RC_633_nPDOWN_GPIO                                  GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_RC_633_nPDOWN_GPIO_PIN                                24U   /*!< GPIO pin number */
#define BOARD_INITPINS_RC_633_nPDOWN_GPIO_PIN_MASK                   (1U << 24U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_RC_633_nPDOWN_PORT                                  GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_RC_633_nPDOWN_PIN                                     24U   /*!< PORT pin number */
#define BOARD_INITPINS_RC_633_nPDOWN_PIN_MASK                        (1U << 24U)   /*!< PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/* GPIO_AD_B1_00 (coord J11), I2C1_SCL/CSI_I2C_SCL/J35[20]/J23[6]/U13[17]/U32[4] */
/* Routed pin properties */
#define BOARD_INITI2CPINS_I2C_CLK_PERIPHERAL                              LPI2C1   /*!< Peripheral name */
#define BOARD_INITI2CPINS_I2C_CLK_SIGNAL                                     SCL   /*!< Signal name */

/* GPIO_AD_B1_01 (coord K11), I2C1_SDA/CSI_I2C_SDA/J35[22]/J23[5]/U13[18]/U32[6] */
/* Routed pin properties */
#define BOARD_INITI2CPINS_I2C_SDA_PERIPHERAL                              LPI2C1   /*!< Peripheral name */
#define BOARD_INITI2CPINS_I2C_SDA_SIGNAL                                     SDA   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI2CPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_NFCPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
